import streamlit as st

st.title("Tест по география")
st.write("Отговори на въпросите и натисни **Изпрати**")

q1 = st.radio(
    "1️⃣ Коя е столицата на България?",
    ("София", "Пловдив", "Варна")
    index=None
)

q2 = st.radio(
    "2️⃣ На кой континент се намира България?",
    ("Европа", "Азия", "Африка")
    index=None
)

q3 = st.radio(
    "3️⃣ Кое е най-голямото море до България?",
    ("Черно море", "Средиземно море", "Червено море")
    index=None
)

q4 = st.radio(
    "4️⃣ Коя планина е в България?",
    ("Рила", "Алпи", "Хималаи")
    index=None
)

q5 = st.radio(
    "5️⃣ Коя река минава през Русе?",
    ("Дунав", "Марица", "Струма")
    index=None
)

if st.button("Изпрати"):
    score = 0

    if q1 == "София":
        score += 1
    if q2 == "Европа":
        score += 1
    if q3 == "Черно море":
        score += 1
    if q4 == "Рила":
        score += 1
    if q5 == "Дунав":
        score += 1

    st.write("### Резултат:")
    st.write(f"Верни отговори: **{score} / 5**")

    if score == 5:
        st.success("Отлично! Географията ти е супер!")
    elif score >= 3:
        st.warning("Добре, но може още малко!")
    else:
        st.error("Опитай отново!")
